#include <stdio.h>

int main(void)
{
	long a, b, c, d, p, n, t;
	while (1)
    {
		scanf("%ld",&p);
		if(p % 5 != 0 && p % 2 != 0)
        {
			break;
		}
	}/*根据题目要求，输入的数不可能是5（乘积之后数字尾数会是0和1）或者2的倍数（11..11的尾数是1）*/
	/*保证运行程序的条件正确*/
	a=0;
    n=0;
	while (a < p)
    {
		a = a * 10 + 1;
		n++;
	}/*求出比输入数字位数多1的11..11，便于后面的除法，后面将会见证到此思路的神奇*/
	t = 0;
	do
    {
		c = a / p;
		printf("%ld", c);/*输出右对齐，输出位数大于1时就正常输出，小于1时就输出个空格在输出，个人认为没有必要*/
		t++;
		if (t % 50 == 0)
        {
			printf("\n");
		}/*位数超过50就换行*/
		d = a - c * p;/*一下三行代码简直就是精华，注意斟酌*/
		a=d * 10 + 1;/*+1十分细节，相当于原被除数的数在末尾多加一位1*/
		n++;
	} while ( d > 0 );/*只要有余数，就继续执行该循环体*/
	printf("\n%ld\n", n-1);/*注意区别 n和t两个计数器变量的不同，n是位数+1，t用来控制在一行输出的量，d=0时n++还会再执行一次，因此要减去1*/
	return 0;
}
